/* 0. Демонстрация решения

Напишите программу, которая на вход
принимает число и выдаёт его квадрат (число
умноженное на само себя). */

/* int n=10;
Console.WriteLine("Число: " +n);
Console.WriteLine("Квадрат: " +n*n); */

Console.WriteLine("Введите число: ");
int n=int.Parse(Console.ReadLine());
Console.WriteLine("Число: " +n);
Console.WriteLine("Квадрат: " +n*n);

/* int A=10;
int i=0;
while (i<=A)
{
    Console.WriteLine(i);
    i++;
} */